# SetActiveServers Method

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
MultiServerService..::..SetActiveServers Method
MultiServerService Class See Also
---
# Overload List
| Name | Description |
| --- | --- |
| --- | --- | --- |
| SetActiveServers(IList<(Of <<'(Guid>)>>)) | Changes the active servers and/or their order. |
| SetActiveServers(IList<(Of <<'(Guid>)>>), Document) | Changes the active servers and/or their order for the given document. |

# See Also
MultiServerService Class
MultiServerService Members
Autodesk.Revit.DB.ExternalService Namespace